In [8]:
import numpy as np

In [9]:
a = np.array([[1,2,3,3,1],[6,8,11,10,7]])

In [10]:
a

array([[ 1,  2,  3,  3,  1],
       [ 6,  8, 11, 10,  7]])

Задание 2

In [11]:
mean_a = np.mean(a)

In [12]:
mean_a

5.2

Задание 3

In [13]:
a_centered = a - mean_a

In [14]:
a_centered

array([[-4.2, -3.2, -2.2, -2.2, -4.2],
       [ 0.8,  2.8,  5.8,  4.8,  1.8]])

In [15]:
a_centered_sp = a_centered[0][0] + a_centered[0][1]

In [20]:
a_centered_sp

-7.4

In [21]:
a_centered_sp = a_centered[0][0] * a_centered[0][1] + a_centered[0][1] * a_centered[1][1] + a_centered[0][2] * a_centered[1][2] + a_centered[0][3] * a_centered[1][3] + a_centered[0][4] * a_centered[1][4]

In [22]:
a_centered_sp

-26.399999999999995

In [23]:
a_centered_sp / 5

-5.279999999999999

Задание 1

In [24]:
import pandas as pd

In [25]:
authors = {'author_id' : [1, 2, 3],
          'author_name' : ['Тургенев', 'Чехов', 'Островский']}

In [26]:
authors = pd.DataFrame(authors)

In [27]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [28]:
book = {'author_id' : [1, 1, 1, 2, 2, 3, 3],
        'book_title' : ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
        'price' : [450, 300, 350, 500, 450, 370, 290]}

In [29]:
book = pd.DataFrame(book)

In [30]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [38]:
autors_price = pd.merge(left=authors,
                       right=book,
                       on='author_id')

In [39]:
autors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [45]:
top5 = autors_price.nlargest(5, 'price')

In [46]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4

In [47]:
authors_stat = autors_price['author_name'].value_counts()

In [48]:
authors_stat

Тургенев      3
Чехов         2
Островский    2
Name: author_name, dtype: int64

In [49]:
authors_stat = autors_price.groupby('author_name').agg({'price':['min', 'max', 'mean']})
authors_stat = authors_stat.rename(columns={'min':'min_price', 'max':'max_price', 'mean':'mean_price'})
print(authors_stat)

                price
            min_price max_price  mean_price
author_name
Островский        290       370  330.000000
Тургенев          300       450  366.666667
Чехов             450       500  475.000000